Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle.AddTriangles(System.Collections.Generic.IList{Autodesk.Revit.DB.DirectContext3D.IndexTriangle})
Inserts multiple Autodesk.Revit.DB.DirectContext3D.IndexTriangle instances into the stream and associated buffer.
triangles:
The triangles to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle.AddTriangle(Autodesk.Revit.DB.DirectContext3D.IndexTriangle)
Inserts a Autodesk.Revit.DB.DirectContext3D.IndexTriangle into the stream and associated buffer.
triangle:
The triangle to be inserted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if the associated buffer is not mapped.
-or-
Thrown if the associated buffer has insufficient space.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle
A stream that can be used to write Autodesk.Revit.DB.DirectContext3D.IndexTriangle
primitives into an Autodesk.Revit.DB.DirectContext3D.IndexBuffer
Since:
2017